# /bin/env python
# -*- encode: utf-8 -*-
__author__ = '@britodfbr'


def decodeMorse(morse_code):
    morse_dict = {
        '0': '-----',
        '1': '.----',
        '2': '..---',
        '3': '...--',
        '4': '....-',
        '5': '.....',
        '6': '-....',
        '7': '--...',
        '8': '---..',
        '9': '----.',
        'A': '.-',
        'B': '-...',
        'C': '-.-.',
        'Ch': '----',
        'D': '-..',
        'E': '.',
        'F': '..-.',
        'G': '--.',
        'H': '....',
        'I': '..',
        'J': '.---',
        'K': '-.-',
        'L': '.-..',
        'M': '--',
        'N': '-.',
        'O': '---',
        'P': '.--.',
        'Q': '--.-',
        'R': '.-.',
        'S': '...',
        'T': '-',
        'U': '..-',
        'V': '...-',
        'W': '.--',
        'X': '-..-',
        'Y': '-.--',
        'Z': '--..',
        'Á': '.--.-',
        'Ä': '.-.-',
        'Å': '.--.-',
        'É': '..-..',
        'Ñ': '--.--',
        'Ö': '---.',
        'Ü': '..--',
        ' ': '§',
        'SOS': '...---...',
        '.': '.-.-.-',
        '!': '-.-.--',
    }
    decode_morse = {y: x for x, y in morse_dict.items()}
    # print(decode_morse)
    morse_code = morse_code.strip().replace('   ', ' § ')
    # print(morse_code)
    return ''.join([decode_morse.get(x) for x in morse_code.split()])
